letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
                case 2:
                    sprintf(setting_str, " Month: %02u", *month);
                    break;

                case 3:
                    sprintf(setting_str, "   Year: %02u", *year);
                    break;

                case 4:
                    sprintf(setting_str, "  Hours: %02u", *hours);
                    break;

                case 5:
                    sprintf(setting_str, "Minutes: %02u", *minutes);
                    break;

                case 6:
                    sprintf(setting_str, "Seconds: %02u", *seconds);
                    break;

                default:
                    break;
            }

            ssd->drawText(setting_str, 15, 40, 0xFF);
            ssd->drawText("^ / v: add / sub", 10, 76, 0xFF);
            ssd->drawText("< / >: next / prev", 5, 86, 0xFF);
            ssd->drawText("A : Save & return", 13, 96, 0xFF);
            ssd->drawText("B : Cancel", 23, 106, 0xFF);
            ssd->show();

            if (click_button(btnA)) {
                *isInSettingMode = false;
                *page            = 0;
                rtc->setTime(*hours, *minutes, *seconds);
                rtc->setDate(static_cast<RTC_Week_Day>(*weekday), *day, static_cast<RTC_Month>(*month), *year);
            }
            if (click_button(btnB)) {
                *isInSettingMode = false;
                *page            = 0;
            }
        }
        else {
            date = rtc->getDate();
            time = rtc->getTime();

            *weekday = static_cast<uint8_t>(date.weekday);
            *day     = date.day;
            *month   = static_cast<uint8_t>(date.month);
            *year    = date.year;
            *hours   = time.hours;
            *minutes = time.minutes;
            *seconds = time.seconds;

            sprintf(date_str, "%.3s. %02u/%02u/%02u", weekdayToStr(*weekday), *day, *month, *year);
            sprintf(time_str, "%02u:%02u:%02u", *hours, *minutes, *seconds);

            ssd->fill(0x00);
            ssd->drawText(date_str, 25, 30, 0xFF);
            ssd->drawText(time_str, 40, 40, 0xFF);
            ssd->drawText("A : Set date & time", 8, 75, 0xFF);
            ssd->show();

            if (click_button(btnA)) {
                *isInSettingMode = true;
            }
        }

        fiber_sleep(100);
    }
}

void show_button()
{
    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        bool up_state    = mcp->getLevel(MCP_GP_UP) == MCP_LOGIC_LEVEL::HIGH;
        bool down_state  = mcp->getLevel(MCP_GP_BOTTOM) == MCP_LOGIC_LEVEL::HIGH;
        bool left_state  = mcp->getLevel(MCP_GP_LEFT) == MCP_LOGIC_LEVEL::HIGH;
        bool right_state = mcp->getLevel(MCP_GP_RIGHT) == MCP_LOGIC_LEVEL::HIGH;
        bool a_state     = btnA->getDigitalValue() == 1;
        bool b_state     = btnB->getDigitalValue() == 1;

        ssd->fill(0x00);
        ssd->drawText("Up: " + string(up_state ? "HIGH" : "LOW"), 12, 33, 0xFF);
        ssd->drawText("Down: " + string(down_state ? "HIGH" : "LOW"), 7, 45, 0xFF);
        ssd->drawText("Left: " + string(left_state ? "HIGH" : "LOW"), 2, 56, 0xFF);
        ssd->drawText("Right: " + string(right_state ? "HIGH" : "LOW"), 2, 69, 0xFF);
        ssd->drawText("A: " + string(a_state ? "HIGH" : "LOW"), 7, 81, 0xFF);
        ssd->drawText("B: " + string(b_state ? "HIGH" : "LOW"), 12, 93, 0xFF);
        ssd->show();

        fiber_sleep(1);
    }
}

void show_rgb()
{
    uint8_t* select_line = new uint8_t(0);
    int state_red        = 0;
    int state_green      = 0;
    int state_blue       = 0;

    mcp->interruptOnFalling(MCP_GP_BOTTOM, [=]() {
        if (*select_line < 2) {
            (*select_line)++;
        }
    });

    mcp->interruptOnFalling(MCP_GP_UP, [=]() {
        if (*select_line > 0) {
            (*select_line)--;
        }
    });

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (click_button(btnA)) {
            switch (*select_line) {
                case 0:
                    state_red = state_red == 0 ? 1 : 0;
                    led_red->setDigitalValue(state_red);
                    break;

                case 1:
                    state_green = state_green == 0 ? 1 : 0;
                    led_green->setDigitalValue(state_green);
                    break;

                case 2:
                    state_blue = state_blue == 0 ? 1 : 0;
                    led_blue->setDigitalValue(state_blue);
                    break;
            }
        }

        ssd->fill(0x00);
        ssd->drawText("Toggle Red LED", 15, 51, 0xFF);
        ssd->drawText("Toggle Green LED", 15, 60, 0xFF);
        ssd->drawText("Toggle Blue LED", 15, 69, 0xFF);
        ssd->drawText(">", 5, (*select_line) * 9 + 51, 0xFF);
        ssd->show();

        fiber_sleep(1);
    }

    mcp->disableInterrupt(MCP_GP_BOTTOM);
    mcp->disableInterrupt(MCP_GP_UP);
    led_red->setDigitalValue(0);
    led_green->setDigitalValue(0);
    led_blue->setDigitalValue(0);
    delete select_line;
}

void show_screen()
{
    ssd->fill(0x00);

    uint16_t color = 0xFF;
    uint8_t shape  = 4;

    while (1) {
        for (unsigned i = 0; i < 35; ++i) {
            if (click_button(btnMenu)) {
                return;
            }

            if (shape == 0)
                ssd->drawCircle(64, 64, i, true, color);
            else if (shape == 1)
                ssd->drawRectangle(64 - i * 2, 64 - i * 2, 64 + i * 2, 64 + i * 2, true, color);
            else if (shape == 2)
                ssd->drawPolygon(64, 64, 5, i * 2, 3, color);
            else if (shape == 3)
                ssd->drawPolygon(64, 64, 3, i * 2, 3, color);
            else if (shape == 4)
                for (float deg = 0; deg < 360; deg += 0.5) {
                    float theta = deg * 0.0174533;
                    float r     = 10 * theta;  // pow(5, theta);

                    ssd->drawPixel(r * cos(r) + 64, r * sin(r) + 64, color);
                }

            ssd->show();
        }

        color = ~color;
        shape++;
        if (shape >= 5) shape = 0;
    }
}

void show_battery()
{
    uint32_t timeout   = getCurrentMillis();
    bool is_first_page = true;
    char buff[16]      = {0};

    battery->reset();

    ssd->fill(0x00);
    ssd->drawText("Waiting for the init", 4, 60, 0xFF);
    ssd->show();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

