letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
        if (!battery->is_init()) {
            if ((getCurrentMillis() - timeout) >= 5000) {
                ssd->fill(0x00);
                ssd->drawText("TIMEOUT", 44, 50, 0xFF);
                ssd->drawText("No battery connected", 4, 60, 0xFF);
                ssd->show();
            }
        }
        else {
            if (is_first_page) {
                ssd->fill(0x00);
                ssd->drawText("Charge: " + fToStr(battery->state_of_charge(), 0) + "%", 5, 45, 0xFF);
                ssd->drawText("Voltage: " + fToStr(battery->get_voltage(), 2) + "V", 5, 53, 0xFF);
                ssd->drawText("Avg. Current: " + fToStr(battery->get_average_current(), 2) + "A", 5, 62, 0xFF);
                ssd->drawText("Avg. Power: " + fToStr(battery->get_average_power(), 2) + "W", 5, 71, 0xFF);
                ssd->show();
            }
            else {
                ssd->fill(0x00);
                ssd->drawText("Temp.: " + fToStr(battery->get_temperature(), 2) + "C", 5, 45, 0xFF);

                sprintf(buff, "0x%04X", battery->device_type());
                ssd->drawText("Dev. type: " + std::string(buff), 5, 53, 0xFF);

                sprintf(buff, "0x%04X", battery->firmware_version());
                ssd->drawText("Firm. ver: " + std::string(buff), 5, 62, 0xFF);

                sprintf(buff, "0x%04X", battery->dm_code());
                ssd->drawText("DM code: " + std::string(buff), 5, 71, 0xFF);

                ssd->show();
            }

            if (getCurrentMillis() - timeout > 3000) {
                is_first_page = !is_first_page;
                timeout       = getCurrentMillis();
            }
        }

        fiber_sleep(10);
    }
}

void show_pads()
{
    int r = 3;

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        bool gp1 = mcp->getLevel(MCP_GPIO_1) == MCP_LOGIC_LEVEL::HIGH;
        bool gp2 = mcp->getLevel(MCP_GPIO_2) == MCP_LOGIC_LEVEL::HIGH;
        bool gp3 = mcp->getLevel(MCP_GPIO_3) == MCP_LOGIC_LEVEL::HIGH;
        bool gp4 = mcp->getLevel(MCP_GPIO_4) == MCP_LOGIC_LEVEL::HIGH;

        ssd->fill(0x00);
        ssd->drawCircle(8, 41, r, true, 0xFF);
        ssd->drawCircle(14, 30, r, gp3, 0xFF);
        ssd->drawCircle(22, 20, r, gp4, 0xFF);
        ssd->drawCircle(32, 13, r, false, 0xFF);
        ssd->drawChar('G', 30, 10, 0xFF);
        ssd->drawChar('V', 6, 38, 0x00);

        ssd->drawCircle(119, 41, r, true, 0xFF);
        ssd->drawCircle(113, 30, r, gp2, 0xFF);
        ssd->drawCircle(105, 20, r, gp1, 0xFF);
        ssd->drawCircle(95, 13, r, false, 0xFF);
        ssd->drawChar('G', 93, 10, 0xFF);
        ssd->drawChar('V', 117, 38, 0x00);

        ssd->drawChar(gp3 ? '1' : '0', 12, 27, gp3 ? 0x00 : 0xFF);
        ssd->drawChar(gp4 ? '1' : '0', 20, 17, gp4 ? 0x00 : 0xFF);
        ssd->drawChar(gp2 ? '1' : '0', 111, 27, gp2 ? 0x00 : 0xFF);
        ssd->drawChar(gp1 ? '1' : '0', 103, 17, gp1 ? 0x00 : 0xFF);

        ssd->show();

        fiber_sleep(10);
    }
}

void show_microbit()
{
    constexpr uint16_t arc_angle = 360 / 19;
    uint8_t pin_index            = 0;
    uint32_t start_time          = 0;
    bool* is_led_mode            = new bool{true};

    mcp->interruptOnFalling(MCP_GP_BOTTOM, [=]() {
        *is_led_mode = !(*is_led_mode);

        if (*is_led_mode) {
            microbit_pins[0]->setDigitalValue(0);
        }
        else {
            microbit_pins[0]->getDigitalValue();
        }
    });

    for (int i = 0; i < 19; ++i) {
        microbit_pins[i]->setDigitalValue(0);
    }

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (*is_led_mode) {
            if (getCurrentMillis() - start_time < 500) {
                continue;
            }

            if (pin_index == 0) {
                microbit_pins[18]->setDigitalValue(0);
            }
            else {
                microbit_pins[pin_index - 1]->setDigitalValue(0);
            }

            microbit_pins[pin_index]->setDigitalValue(1);

            ssd->fill(0x00);
            ssd->drawArc(64, 64, 60, arc_angle * pin_index, arc_angle * (pin_index + 1), 0xFF);
            ssd->drawText("Turn on pin:", 29, 40, 0xFF);
            ssd->drawText((pin_index + 1 < 10 ? "0" : "") + to_string(pin_index + 1), 57, 49, 0xFF);
            ssd->drawText("Down: Self test", 20, 90, 0xFF);
            ssd->show();

            pin_index++;
            if (pin_index >= 19) {
                pin_index = 0;
            }
            start_time = getCurrentMillis();
        }
        else {
            if (pin_index == 0) {
                microbit_pins[18]->setDigitalValue(0);
                pin_index = 1;
            }
            else {
                microbit_pins[pin_index - 1]->setDigitalValue(0);
            }

            microbit_pins[pin_index]->setDigitalValue(1);

            ssd->fill(0x00);
            ssd->drawArc(64, 64, 60, arc_angle * pin_index, arc_angle * (pin_index + 1), 0xFF);
            ssd->drawText("Turn on pin:", 29, 30, 0xFF);
            ssd->drawText((pin_index + 1 < 10 ? "0" : "") + to_string(pin_index + 1), 57, 39, 0xFF);
            ssd->drawText("Result:", 46, 57, 0xFF);
            ssd->drawText(microbit_pins[0]->getDigitalValue() == 1 ? "O.K" : "K.O", 55, 69, 0xFF);
            ssd->drawText("Down: LED test", 22, 90, 0xFF);
            ssd->show();

            if (getCurrentMillis() - start_time >= 500) {
                pin_index++;
                if (pin_index >= 19) {
                    pin_index = 0;
                }
                start_time = getCurrentMillis();
            }
        }

        fiber_sleep(1);
    }

    for (int i = 0; i < 19; ++i) {
        microbit_pins[i]->setDigitalValue(0);
    }

    btnA->getDigitalValue();
    btnB->getDigitalValue();
}

void show_pwm_microbit()
{
    constexpr uint16_t pwm_step = 20;
    uint32_t start_timeout      = 0;
    uint8_t* pin_id             = new uint8_t{0};
    uint16_t* pwm_value         = new uint16_t{0};

