letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
    mcp->interruptOnFalling(MCP_GP_BOTTOM, [=]() {
        *pin_id = ((*pin_id) == 2) ? 0 : (*pin_id) + 1;

        if (*pin_id == 0) {
            microbit_pwm_pins[2]->setAnalogValue(0);
        }
        else {
            microbit_pwm_pins[(*pin_id) - 1]->setAnalogValue(0);
        }

        (*pwm_value) = 0;
    });

    mcp->interruptOnFalling(MCP_GP_UP, [=]() {
        *pin_id = ((*pin_id) == 0) ? 2 : (*pin_id) - 1;

        if (*pin_id == 2) {
            microbit_pwm_pins[0]->setAnalogValue(0);
        }
        else {
            microbit_pwm_pins[(*pin_id) + 1]->setAnalogValue(0);
        }

        (*pwm_value) = 0;
    });

    for (int i = 0; i < 19; ++i) {
        microbit_pins[i]->setDigitalValue(0);
    }

    fiber_sleep(500);

    for (uint8_t i = 0; i < 3; ++i) {
        printf("Init PWM pin #%u (result: %d)\n", i, microbit_pwm_pins[i]->setAnalogValue(0));
    }

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (getCurrentMillis() - start_timeout >= 100) {
            (*pwm_value) += pwm_step;

            if (*pwm_value >= 1024) {
                *pwm_value = 0;
            }

            microbit_pwm_pins[*pin_id]->setAnalogValue(*pwm_value);

            ssd->fill(0x00);
            ssd->drawText("Pin: 0" + to_string(*pin_id), 42, 36, 0xFF);
            ssd->drawText(string("PWM value:") + ((*pwm_value < 1000) ? "0" : "") + ((*pwm_value < 100) ? "0" : "") +
                              ((*pwm_value < 10) ? "0" : "") + to_string(*pwm_value),
                          20, 52, 0xFF);
            ssd->drawText("Up: Prev. pin", 28, 84, 0xFF);
            ssd->drawText("Down: Next pin", 24, 97, 0xFF);
            ssd->show();

            start_timeout = getCurrentMillis();
        }

        fiber_sleep(1);
    }

    for (int i = 0; i < 19; ++i) {
        microbit_pins[i]->setDigitalValue(0);
    }

    btnA->getDigitalValue();
    btnB->getDigitalValue();
}

void show_analog_microbit()
{
    while (1) {
        if (click_button(btnMenu)) {
            break;
        }
    }
}

void show_jacdac()
{
    uint32_t timeout     = 0;
    uint8_t data_to_send = 0;
    char buff[3]         = {0};
    bool is_tx_mode      = true;
    jacdac->setMode(SingleWireMode::SingleWireTx);

    timeout = getCurrentMillis();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (click_button(btnA)) {
            if (is_tx_mode) {
                is_tx_mode = false;
                jacdac->setMode(SingleWireMode::SingleWireRx);
                memset(buff, 'x', 3);
            }
            else {
                is_tx_mode = true;
                jacdac->setMode(SingleWireMode::SingleWireTx);
                data_to_send = 0;
            }

            timeout = getCurrentMillis();
        }

        if (is_tx_mode) {
            if (getCurrentMillis() - timeout > 1000) {
                data_to_send++;
                timeout = getCurrentMillis();
            }

            sprintf(buff, "%03u", data_to_send);

            ssd->fill(0x00);
            ssd->drawText("Mode: Tx", 40, 24, 0xFF);
            ssd->drawText("Send value:", 34, 51, 0xFF);
            ssd->drawText(buff, 56, 62, 0xFF);
            ssd->drawText("A: Change to Rx", 19, 95, 0xFF);
            ssd->show();

            jacdac->putc(data_to_send);
        }
        else {
            uint8_t rcv = jacdac->getc();

            if (rcv != DEVICE_NO_DATA) {
                sprintf(buff, "%03u", rcv);
            }

            ssd->fill(0x00);
            ssd->drawText("Mode: Rx", 40, 24, 0xFF);
            ssd->drawText("Read value:", 34, 51, 0xFF);
            ssd->drawText(buff, 56, 62, 0xFF);
            ssd->drawText("A: Change to Tx", 19, 95, 0xFF);
            ssd->show();
        }

        fiber_sleep(100);
    }
}
void show_qwic()
{
    ssd->fill(0x00);
    ssd->drawText("  Not available...", 5, 60, 0xFF);
    ssd->show();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        fiber_sleep(1);
    }
}

void Demo_main(codal::STM32STEAM32_WB55RG& steam32)
{
    spi     = &steam32.spi1;
    cs      = &steam32.io.PD_0;
    dc      = &steam32.io.PB_4;
    rst     = &steam32.io.PA_12;
    ssd     = new SSD1327_SPI(*spi, *cs, *dc, *rst, 128, 128);
    btnMenu = &steam32.io.PA_0;
    btnA    = &steam32.io.PA_7;
    btnB    = &steam32.io.PA_8;
    buzzer  = &steam32.io.PA_11;

    led_red   = &steam32.io.PC_12;
    led_green = &steam32.io.PC_11;
    led_blue  = &steam32.io.PC_10;

    buzzer->setAnalogValue(0);

    steam32.serial.init(115200);
    steam32.sleep(500);

    printf("Init peripherals !\r\n");

    ssd->init();
    ssd->fill(0x00);
    ssd->drawText("Initialization...", 15, 60, 0xFF);
    ssd->show();

    battery = new BQ27441(&steam32.i2c1);
    mcp     = new MCP23009E(steam32.i2c1, 0x40, steam32.io.PB_1, steam32.io.PB_0);
    hts     = new HTS221(&steam32.i2c1, 0xBE);
    pres    = new WSEN_PADS(steam32.i2c1, 0xBA);
    apds    = new APDS9960(steam32.i2c1, 0x72);
    tof     = new VL53L1X(&steam32.i2c1);
    ism     = new ISM330DL(&steam32.i2c1);
    lis     = new LIS2MDL(&steam32.i2c1);
    sai     = new STM32SAI(&steam32.io.PA_10, &steam32.io.PA_3, GPIO_AF3_SAI1, AUDIO_BUFFER);
    jacdac  = new STM32SingleWireSerial(steam32.io.PB_6);
    rtc     = new STM32RTC();

    battery->init();

    mcp->setup(MCP_GPIO_1, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_2, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_3, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_4, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GP_RIGHT, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_BOTTOM, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_LEFT, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_UP, MCP_DIR::INPUT);

    hts->init();
    hts->setOutputRate(codal::HTS221_OUTPUT_RATE::RATE_7HZ);

    pres->init();

    tof->init();

    ism->init();
    ism->setAccelerometerODR(ISM_ODR::F_1_66_KHZ);
    ism->setGyroscopeODR(ISM_ODR::F_208_HZ);

    lis->init();
    lis->setODR(LIS2_ODR::F_50_HZ);
    lis->setLowPassFilter(true);

    apds->init();

    if (!sai->init()) {
        printf("Failed to init SAI\r\n");
    }
    sai->onReceiveData(micro_on_data);

