letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
    jacdac->init(115200);
    jacdac->setMode(SingleWireMode::SingleWireTx);

    rtc->init();

    microbit_pins[0]  = &steam32.io.PA_2;
    microbit_pins[1]  = &steam32.io.PC_4;
    microbit_pins[2]  = &steam32.io.PA_4;
    microbit_pins[3]  = &steam32.io.PA_7;
    microbit_pins[4]  = &steam32.io.PC_3;
    microbit_pins[5]  = &steam32.io.PA_9;
    microbit_pins[6]  = &steam32.io.PA_5;
    microbit_pins[7]  = &steam32.io.PA_15;
    microbit_pins[8]  = &steam32.io.PC_2;
    microbit_pins[9]  = &steam32.io.PA_6;
    microbit_pins[10] = &steam32.io.PA_8;
    microbit_pins[11] = &steam32.io.PC_6;
    microbit_pins[12] = &steam32.io.PC_5;
    microbit_pins[13] = &steam32.io.PB_13;
    microbit_pins[14] = &steam32.io.PB_14;
    microbit_pins[15] = &steam32.io.PB_15;
    microbit_pins[16] = &steam32.io.PE_4;
    microbit_pins[17] = &steam32.io.PC_0;
    microbit_pins[18] = &steam32.io.PC_1;

    microbit_pwm_pins[0] = &steam32.io.PA_9;
    microbit_pwm_pins[1] = &steam32.io.PA_6;
    microbit_pwm_pins[2] = &steam32.io.PA_8;

    steam32.sleep(500);

    ssd->fill(0x00);
    ssd->drawText("Hello STeaMi !", 20, 60, 0xFF);
    ssd->show();
    printf("Hello STeaMi !\r\n");
    steam32.sleep(1500);

    vector<MenuEntry> mainMenuEntries = {{"Temp & Hum", []() -> void { show_temp_hum(); }},
                                         {"Pressure", []() -> void { show_pressure(); }},
                                         {"Time Of Flight", []() -> void { show_tof(); }},
                                         {"Acc / Gyro / Magn", []() -> void { show_acc_gyro_magn(); }},
                                         {"Color Sensor", []() -> void { show_optical_sensor(); }},
                                         {"Microphone", []() -> void { show_microphone(); }},
                                         {"RTC", []() -> void { show_rtc(); }},
                                         {"Buzzer", []() -> void { show_buzzer(); }},
                                         {"Buttons", []() -> void { show_button(); }},
                                         {"LEDs", []() -> void { show_rgb(); }},
                                         {"Screen", []() -> void { show_screen(); }},
                                         {"Battery", []() -> void { show_battery(); }},
                                         {"Pads \"tete\"", []() -> void { show_pads(); }},
                                         {"Pads micro:bit", []() -> void { show_microbit(); }},
                                         {"PWM micro:bit", []() -> void { show_pwm_microbit(); }},
                                         {"Analog micro:bit", []() -> void { show_analog_microbit(); }},
                                         {"jacdac (SWS)", []() -> void { show_jacdac(); }},
                                         {"(QWIC)", []() -> void { show_qwic(); }}};
    mainMenu                          = new ScreenMenu(*ssd, mainMenuEntries);

    while (1) {
        show_main_menu();
    }
}